MaJerle/stm32f429/00-STM32_SVD/STM32F303xE.svd
cription><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2RST</name><description>I2C2 reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>USBRST</name><description>USB reset</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CANRST</name><description>CAN reset</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>PWRRST</name><description>Power interface reset</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>DACRST</name><description>DAC interface reset</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHBENR</name><displayName>AHBENR</displayName><description>AHB Peripheral Clock enable register           (RCC_AHBENR)</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000014</resetValue><fields><field><name>DMAEN</name><description>DMA1 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA2EN</name><description>DMA2 clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAMEN</name><description>SRAM interface clock               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FLITFEN</name><description>FLITF clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCEN</name><description>CRC clock enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPAEN</name><description>I/O port A clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPBEN</name><description>I/O port B clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPCEN</name><description>I/O port C clock enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPDEN</name><description>I/O port D clock enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPEEN</name><description>I/O port E clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPFEN</name><description>I/O port F clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TSCEN</name><description>Touch sensing controller clock               enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC12EN</name><description>ADC1 and ADC2 clock enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC34EN</name><description>ADC3 and ADC4 clock enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2ENR</name><displayName>APB2ENR</displayName><description>APB2 peripheral clock enable register           (RCC_APB2ENR)</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SYSCFGEN</name><description>SYSCFG clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1EN</name><description>TIM1 Timer clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1EN</name><description>SPI 1 clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM8EN</name><description>TIM8 Timer clock enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1EN</name><description>USART1 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM15EN</name><description>TIM15 timer clock enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM16EN</name><description>TIM16 timer clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM17EN</name><description>TIM17 timer clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1ENR</name><displayName>APB1ENR</displayName><description>APB1 peripheral clock enable register           (RCC_APB1ENR)</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM2EN</name><description>Timer 2 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3EN</name><description>Timer 3 clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4EN</name><description>Timer 4 clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM6EN</name><description>Timer 6 clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM7EN</name><description>Timer 7 clock enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGEN</name><description>Window watchdog clock               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2EN</name><description>SPI 2 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI3EN</name><description>SPI 3 clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2EN</name><description>USART 2 clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1EN</name><description>I2C 1 clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2EN</name><description>I2C 2 clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>USBEN</name><description>USB clock enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CANEN</name><description>CAN clock enable</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>PWREN</name><description>Power interface clock               enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>DACEN</name><description>DAC interface clock enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BDCR</name><displayName>BDCR</displayName><description>Backup domain control register           (RCC_BDCR)</description><addressOffset>0x20</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>LSEON</name><description>External Low Speed oscillator               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDY</name><description>External Low Speed oscillator               ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSEBYP</name><description>External Low Speed oscillator               bypass</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSEDRV</name><description>LSE oscillator drive               capability</description><bitOffset>3</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>RTCSEL</name><description>RTC clock source selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>RTCEN</name><description>RTC clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BDRST</name><description>Backup domain software               reset</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CSR</name><displayName>CSR</displayName><description>Control/status register           (RCC_CSR)</description><addressOffset>0x24</addressOffset><size>0x20</size><resetValue>0x0C000000</resetValue><fields><field><name>LSION</name><description>Internal low speed oscillator               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDY</name><description>Internal low speed oscillator               ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RMVF</name><description>Remove reset flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OBLRSTF</name><description>Option byte loader reset               flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINRSTF</name><description>PIN reset flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PORRSTF</name><description>POR/PDR reset flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SFTRSTF</name><description>Software reset flag</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IWDGRSTF</name><description>Independent watchdog reset               flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WWDGRSTF</name><description>Window watchdog reset flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LPWRRSTF</name><description>Low-power reset flag</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHBRSTR</name><displayName>AHBRSTR</displayName><description>AHB peripheral reset register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IOPARST</name><description>I/O port A reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPBRST</name><description>I/O port B reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPCRST</name><description>I/O port C reset</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPDRST</name><description>I/O port D reset</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPERST</name><description>I/O port E reset</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPFRST</name><description>I/O port F reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TSCRST</name><description>Touch sensing controller               reset</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC12RST</name><description>ADC1 and ADC2 reset</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC34RST</name><description>ADC3 and ADC4 reset</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CFGR2</name><displayName>CFGR2</displayName><description>Clock configuration register 2</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PREDIV</name><description>PREDIV division factor</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>ADC12PRES</name><description>ADC1 and ADC2 prescaler</description><bitOffset>4</bitOffset><bitWidth>5</bitWidth></field><field><name>ADC34PRES</name><description>ADC3 and ADC4 prescaler</description><bitOffset>9</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>CFGR3</name><displayName>CFGR3</displayName><description>Clock configuration register 3</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>USART1SW</name><description>USART1 clock source               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>I2C1SW</name><description>I2C1 clock source               selection</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2SW</name><description>I2C2 clock source               selection</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2SW</name><description>USART2 clock source               selection</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>USART3SW</name><description>USART3 clock source               selection</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>TIM1SW</name><description>Timer1 clock source               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM8SW</name><description>Timer8 clock source               selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>UART4SW</name><description>UART4 clock source               selection</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>UART5SW</name><description>UART5 clock source               selection</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral><name>DMA1</name><description>DMA controller 1</description><groupName>DMA</groupName><baseAddress>0x40020000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>DMA1_CH1</name><description>DMA1 channel 1 interrupt</description><value>11</value></interrupt><interrupt><name>DMA1_CH2</name><description>DMA1 channel 2 interrupt</description><value>12</value></interrupt><interrupt><name>DMA1_CH3</name><description>DMA1 channel 3 interrupt</description><value>13</value></interrupt><interrupt><name>DMA1_CH4</name><description>DMA1 channel 4 interrupt</description><value>14</value></interrupt><interrupt><name>DMA1_CH5</name><description>DMA1 channel 5 interrupt</description><value>15</value></interrupt><interrupt><name>DMA1_CH6</name><description>DMA1 channel 6 interrupt</description><value>16</value></interrupt><interrupt><name>DMA1_CH7</name><description>DMA1 channel 7interrupt</description><value>17</value></interrupt><registers><register><name>ISR</name><displayName>ISR</displayName><description>DMA interrupt status register           (DMA_ISR)</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>GIF1</name><description>Channel 1 Global interrupt               flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF1</name><description>Channel 1 Transfer Complete               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF1</name><description>Channel 1 Half Transfer Complete               flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF1</name><description>Channel 1 Transfer Error               flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF2</name><description>Channel 2 Global interrupt               flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF2</name><description>Channel 2 Transfer Complete               flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF2</name><description>Channel 2 Half Transfer Complete               flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF2</name><description>Channel 2 Transfer Error               flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF3</name><description>Channel 3 Global interrupt               flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF3</name><description>Channel 3 Transfer Complete               flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF3</name><description>Channel 3 Half Transfer Complete               flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF3</name><description>Channel 3 Transfer Error               flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF4</name><description>Channel 4 Global interrupt               flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF4</name><description>Channel 4 Transfer Complete               flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF4</name><description>Channel 4 Half Transfer Complete               flag</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF4</name><description>Channel 4 Transfer Error               flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF5</name><description>Channel 5 Global interrupt               flag</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF5</name><description>Channel 5 Transfer Complete               flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF5</name><description>Channel 5 Half Transfer Complete               flag</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF5</name><description>Channel 5 Transfer Error               flag</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF6</name><description>Channel 6 Global interrupt               flag</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF6</name><description>Channel 6 Transfer Complete               flag</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF6</name><description>Channel 6 Half Transfer Complete               flag</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF6</name><description>Channel 6 Transfer Error               flag</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF7</name><description>Channel 7 Global interrupt               flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF7</name><description>Channel 7 Transfer Complete               flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF7</name><description>Channel 7 Half Transfer Complete               flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF7</name><description>Channel 7 Transfer Error               flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IFCR</name><displayName>IFCR</displayName><description>DMA interrupt flag clear register           (DMA_IFCR)</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>CGIF1</name><description>Channel 1 Global interrupt               clear</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF1</name><description>Channel 1 Transfer Complete               clear</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF1</name><description>Channel 1 Half Transfer               clear</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF1</name><description>Channel 1 Transfer Error               clear</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF2</name><description>Channel 2 Global interrupt               clear</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF2</name><description>Channel 2 Transfer Complete               clear</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF2</name><description>Channel 2 Half Transfer               clear</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF2</name><description>Channel 2 Transfer Error               clear</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF3</name><description>Channel 3 Global interrupt               clear</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF3</name><description>Channel 3 Transfer Complete               clear</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF3</name><description>Channel 3 Half Transfer               clear</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF3</name><description>Channel 3 Transfer Error               clear</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF4</name><description>Channel 4 Global interrupt               clear</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF4</name><description>Channel 4 Transfer Complete               clear</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF4</name><description>Channel 4 Half Transfer               clear</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF4</name><description>Channel 4 Transfer Error               clear</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF5</name><description>Channel 5 Global interrupt               clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF5</name><description>Channel 5 Transfer Complete               clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF5</name><description>Channel 5 Half Transfer               clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF5</name><description>Channel 5 Transfer Error               clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF6</name><description>Channel 6 Global interrupt               clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF6</name><description>Channel 6 Transfer Complete               clear</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF6</name><description>Channel 6 Half Transfer               clear</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF6</name><description>Channel 6 Transfer Error               clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF7</name><description>Channel 7 Global interrupt               clear</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF7</name><description>Channel 7 Transfer Complete               clear</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF7</name><description>Channel 7 Half Transfer               clear</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF7</name><description>Channel 7 Transfer Error               clear</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR1</name><displayName>CCR1</displayName><description>DMA channel configuration register           (DMA_CCR)</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>T