MaJerle/stm32f429/00-STM32_SVD/STM32F303xE.svd
et><bitWidth>1</bitWidth></field><field><name>PR15</name><description>Pending bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>PR16</name><description>Pending bit 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>PR17</name><description>Pending bit 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>PR18</name><description>Pending bit 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PR19</name><description>Pending bit 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>PR20</name><description>Pending bit 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>PR21</name><description>Pending bit 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>PR22</name><description>Pending bit 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>PR29</name><description>Pending bit 29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>PR30</name><description>Pending bit 30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>PR31</name><description>Pending bit 31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IMR2</name><displayName>IMR2</displayName><description>Interrupt mask register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0xFFFFFFFC</resetValue><fields><field><name>MR32</name><description>Interrupt Mask on external/internal line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>MR33</name><description>Interrupt Mask on external/internal line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MR34</name><description>Interrupt Mask on external/internal line               34</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>MR35</name><description>Interrupt Mask on external/internal line               35</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EMR2</name><displayName>EMR2</displayName><description>Event mask register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MR32</name><description>Event mask on external/internal line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>MR33</name><description>Event mask on external/internal line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MR34</name><description>Event mask on external/internal line               34</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>MR35</name><description>Event mask on external/internal line               35</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RTSR2</name><displayName>RTSR2</displayName><description>Rising Trigger selection           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TR32</name><description>Rising trigger event configuration bit               of line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TR33</name><description>Rising trigger event configuration bit               of line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FTSR2</name><displayName>FTSR2</displayName><description>Falling Trigger selection           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TR32</name><description>Falling trigger event configuration bit               of line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TR33</name><description>Falling trigger event configuration bit               of line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SWIER2</name><displayName>SWIER2</displayName><description>Software interrupt event           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SWIER32</name><description>Software interrupt on line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SWIER33</name><description>Software interrupt on line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>PR2</name><displayName>PR2</displayName><description>Pending register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PR32</name><description>Pending bit on line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PR33</name><description>Pending bit on line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>COMP</name><description>Comparator</description><groupName>COMP</groupName><baseAddress>0x4001001C</baseAddress><addressBlock><offset>0x0</offset><size>0x19</size><usage>registers</usage></addressBlock><interrupt><name>COMP123</name><description>COMP1 &amp; COMP2 &amp; COMP3 interrupts
        combined with EXTI Lines 21, 22 and 29
        interrupts</description><value>64</value></interrupt><interrupt><name>COMP456</name><description>COMP4 &amp; COMP5 &amp; COMP6 interrupts
        combined with EXTI Lines 30, 31 and 32
        interrupts</description><value>65</value></interrupt><interrupt><name>COMP7</name><description>COMP7 interrupt combined with EXTI Line 33
        interrupt</description><value>66</value></interrupt><registers><register><name>COMP1_CSR</name><displayName>COMP1_CSR</displayName><description>control and status register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP1EN</name><description>Comparator 1 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP1_INP_DAC</name><description>COMP1_INP_DAC</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP1MODE</name><description>Comparator 1 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP1INSEL</name><description>Comparator 1 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP1_OUT_SEL</name><description>Comparator 1 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP1POL</name><description>Comparator 1 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP1HYST</name><description>Comparator 1 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP1_BLANKING</name><description>Comparator 1 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP1OUT</name><description>Comparator 1 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP1LOCK</name><description>Comparator 1 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP2_CSR</name><displayName>COMP2_CSR</displayName><description>control and status register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>COMP2EN</name><description>Comparator 2 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>COMP2MODE</name><description>Comparator 2 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>COMP2INSEL</name><description>Comparator 2 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>COMP2INPSEL</name><description>Comparator 2 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>COMP2INMSEL</name><description>Comparator 1inverting input               selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>COMP2_OUT_SEL</name><description>Comparator 2 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth></field><field><name>COMP2POL</name><description>Comparator 2 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>COMP2HYST</name><description>Comparator 2 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>COMP2_BLANKING</name><description>Comparator 2 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>COMP2LOCK</name><description>Comparator 2 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>COMP3_CSR</name><displayName>COMP3_CSR</displayName><description>control and status register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP3EN</name><description>Comparator 3 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP3MODE</name><description>Comparator 3 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP3INSEL</name><description>Comparator 3 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP3INPSEL</name><description>Comparator 3 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP3_OUT_SEL</name><description>Comparator 3 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP3POL</name><description>Comparator 3 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP3HYST</name><description>Comparator 3 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP3_BLANKING</name><description>Comparator 3 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP3OUT</name><description>Comparator 3 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP3LOCK</name><description>Comparator 3 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP4_CSR</name><displayName>COMP4_CSR</displayName><description>control and status register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP4EN</name><description>Comparator 4 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4MODE</name><description>Comparator 4 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP4INSEL</name><description>Comparator 4 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP4INPSEL</name><description>Comparator 4 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COM4WINMODE</name><description>Comparator 4 window mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4_OUT_SEL</name><description>Comparator 4 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP4POL</name><description>Comparator 4 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4HYST</name><description>Comparator 4 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP4_BLANKING</name><description>Comparator 4 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP4OUT</name><description>Comparator 4 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP4LOCK</name><description>Comparator 4 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP5_CSR</name><displayName>COMP5_CSR</displayName><description>control and status register</description><addressOffset>0x10</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP5EN</name><description>Comparator 5 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP5MODE</name><description>Comparator 5 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP5INSEL</name><description>Comparator 5 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP5INPSEL</name><description>Comparator 5 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP5_OUT_SEL</name><description>Comparator 5 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP5POL</name><description>Comparator 5 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP5HYST</name><description>Comparator 5 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP5_BLANKING</name><description>Comparator 5 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP5OUT</name><description>Comparator51 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP5LOCK</name><description>Comparator 5 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP6_CSR</name><displayName>COMP6_CSR</displayName><description>control and status register</description><addressOffset>0x14</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP6EN</name><description>Comparator 6 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6MODE</name><description>Comparator 6 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP6INSEL</name><description>Comparator 6 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP6INPSEL</name><description>Comparator 6 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COM6WINMODE</name><description>Comparator 6 window mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6_OUT_SEL</name><description>Comparator 6 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP6POL</name><description>Comparator 6 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6HYST</name><description>Comparator 6 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP6_BLANKING</name><description>Comparator 6 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP6OUT</name><description>Comparator 6 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP6LOCK</name><description>Comparator 6 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP7_CSR</name><displayName>COMP7_CSR</displayName><description>control and status register</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP7EN</name><description>Comparator 7 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP7MODE</name><description>Comparator 7 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP7INSEL</name><description>Comparator 7 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP7INPSEL</name><description>Comparator 7 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP7_OUT_SEL</name><description>Comparator 7 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP7POL</name><description>Comparator 7 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP7HYST</name><description>Comparator 7 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP7_BLANKING</name><description>Comparator 7 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP7OUT</name><description>Comparator 7 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP7LOCK</name><description>Comparator 7 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>PWR</name><description>Power control</description><groupName>PWR</groupName><baseAddress>0x40007000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>PVD</name><description>PVD through EXTI line detection
        interrupt</description><value>1</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>power control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>LPDS</name><description>Low-power deep sleep</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PDDS</name><description>Power down deepsleep</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CWUF</name><description>Clear wakeup flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CSBF</name><description>Clear standby flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>PVDE</name><description>Power voltage detector               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS</name><description>PVD level selection</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>DBP</name><description>Disable backup domain write               protection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CSR</name><displayName>CSR</displayName><description>power control/status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>WUF</name><description>Wakeup flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SBF</name><description>Standby flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PVDO</name><description>PVD output</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWUP1</name><description>Enable WKUP1 pin</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EWUP2</name><description>Enable WKUP2 pin</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>CAN</name><description>Controller area network</description><groupName>CAN</groupName><baseAddress>0x40006400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>USB_HP_CAN_TX</name><description>USB High Priority/CAN_TX
        interrupts</description><value>19</value></interrupt><interrupt><name>USB_LP_CAN_RX0</name><description>USB Low Priority/CAN_RX0
