MaJerle/stm32f429/00-STM32_SVD/STM32F303xE.svd
        interrupts</description><value>20</value></interrupt><interrupt><name>CAN_RX1</name><description>CAN_RX1 interrupt</description><value>21</value></interrupt><interrupt><name>CAN_SCE</name><description>CAN_SCE interrupt</description><value>22</value></interrupt><registers><register><name>MCR</name><displayName>MCR</displayName><description>master control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00010002</resetValue><fields><field><name>DBF</name><description>DBF</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>RESET</name><description>RESET</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>TTCM</name><description>TTCM</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ABOM</name><description>ABOM</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>AWUM</name><description>AWUM</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NART</name><description>NART</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>RFLM</name><description>RFLM</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TXFP</name><description>TXFP</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SLEEP</name><description>SLEEP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>INRQ</name><description>INRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>MSR</name><displayName>MSR</displayName><description>master status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000C02</resetValue><fields><field><name>RX</name><description>RX</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SAMP</name><description>SAMP</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXM</name><description>RXM</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXM</name><description>TXM</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SLAKI</name><description>SLAKI</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUI</name><description>WKUI</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRI</name><description>ERRI</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SLAK</name><description>SLAK</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INAK</name><description>INAK</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>TSR</name><displayName>TSR</displayName><description>transmit status register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x1C000000</resetValue><fields><field><name>LOW2</name><description>Lowest priority flag for mailbox               2</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW1</name><description>Lowest priority flag for mailbox               1</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW0</name><description>Lowest priority flag for mailbox               0</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME2</name><description>Lowest priority flag for mailbox               2</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME1</name><description>Lowest priority flag for mailbox               1</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME0</name><description>Lowest priority flag for mailbox               0</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CODE</name><description>CODE</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>ABRQ2</name><description>ABRQ2</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR2</name><description>TERR2</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST2</name><description>ALST2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK2</name><description>TXOK2</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP2</name><description>RQCP2</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ1</name><description>ABRQ1</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR1</name><description>TERR1</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST1</name><description>ALST1</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK1</name><description>TXOK1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP1</name><description>RQCP1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ0</name><description>ABRQ0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR0</name><description>TERR0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST0</name><description>ALST0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK0</name><description>TXOK0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP0</name><description>RQCP0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>RF0R</name><displayName>RF0R</displayName><description>receive FIFO 0 register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>RFOM0</name><description>RFOM0</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVR0</name><description>FOVR0</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FULL0</name><description>FULL0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMP0</name><description>FMP0</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>RF1R</name><displayName>RF1R</displayName><description>receive FIFO 1 register</description><addressOffset>0x10</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>RFOM1</name><description>RFOM1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVR1</name><description>FOVR1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FULL1</name><description>FULL1</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMP1</name><description>FMP1</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>IER</name><displayName>IER</displayName><description>interrupt enable register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SLKIE</name><description>SLKIE</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>WKUIE</name><description>WKUIE</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>ERRIE</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LECIE</name><description>LECIE</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFIE</name><description>BOFIE</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>EPVIE</name><description>EPVIE</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>EWGIE</name><description>EWGIE</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FOVIE1</name><description>FOVIE1</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FFIE1</name><description>FFIE1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FMPIE1</name><description>FMPIE1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FOVIE0</name><description>FOVIE0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FFIE0</name><description>FFIE0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FMPIE0</name><description>FMPIE0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TMEIE</name><description>TMEIE</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ESR</name><displayName>ESR</displayName><description>error status register</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>REC</name><description>REC</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>TEC</name><description>TEC</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>LEC</name><description>LEC</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>BOFF</name><description>BOFF</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPVF</name><description>EPVF</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWGF</name><description>EWGF</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>BTR</name><displayName>BTR</displayName><description>bit timing register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x01230000</resetValue><fields><field><name>SILM</name><description>SILM</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>LBKM</name><description>LBKM</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>SJW</name><description>SJW</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth></field><field><name>TS2</name><description>TS2</description><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field><field><name>TS1</name><description>TS1</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>BRP</name><description>BRP</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register><register><name>TI0R</name><displayName>TI0R</displayName><description>TX mailbox identifier register</description><addressOffset>0x180</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TDT0R</name><displayName>TDT0R</displayName><description>mailbox data length control and time stamp           register</description><addressOffset>0x184</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TDL0R</name><displayName>TDL0R</displayName><description>mailbox data low register</description><addressOffset>0x188</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TDH0R</name><displayName>TDH0R</displayName><description>mailbox data high register</description><addressOffset>0x18C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TI1R</name><displayName>TI1R</displayName><description>TX mailbox identifier register</description><addressOffset>0x190</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TDT1R</name><displayName>TDT1R</displayName><description>mailbox data length control and time stamp           register</description><addressOffset>0x194</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TDL1R</name><displayName>TDL1R</displayName><description>mailbox data low register</description><addressOffset>0x198</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TDH1R</name><displayName>TDH1R</displayName><description>mailbox data high register</description><addressOffset>0x19C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TI2R</name><displayName>TI2R</displayName><description>TX mailbox identifier register</description><addressOffset>0x1A0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TDT2R</name><displayName>TDT2R</displayName><description>mailbox data length control and time stamp           register</description><addressOffset>0x1A4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TDL2R</name><displayName>TDL2R</displayName><description>mailbox data low register</description><addressOffset>0x1A8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TDH2R</name><displayName>TDH2R</displayName><description>mailbox data high register</description><addressOffset>0x1AC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RI0R</name><displayName>RI0R</displayName><description>receive FIFO mailbox identifier           register</description><addressOffset>0x1B0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RDT0R</name><displayName>RDT0R</displayName><description>receive FIFO mailbox data length control and           time stamp register</description><addressOffset>0x1B4</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>FMI</name><description>FMI</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>RDL0R</name><displayName>RDL0R</displayName><description>receive FIFO mailbox data low           register</description><addressOffset>0x1B8</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RDH0R</name><displayName>RDH0R</displayName><description>receive FIFO mailbox data high           register</description><addressOffset>0x1BC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RI1R</name><displayName>RI1R</displayName><description>receive FIFO mailbox identifier           register</description><addressOffset>0x1C0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RDT1R</name><displayName>RDT1R</displayName><description>receive FIFO mailbox data length control and           time stamp register</description><addressOffset>0x1C4</addr