MaJerle/stm32f429/00-STM32_SVD/STM32F303xE.svd
me>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>F10R1</name><displayName>F10R1</displayName><description>Filter bank 10 register 1</description><addressOffset>0x290</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>F10R2</name><displayName>F10R2</displayName><description>Filter bank 10 register 2</description><addressOffset>0x294</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>F11R1</name><displayName>F11R1</displayName><description>Filter bank 11 register 1</description><addressOffset>0x298</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>F11R2</name><displayName>F11R2</displayName><description>Filter bank 11 register 2</description><addressOffset>0x29C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>F12R1</name><displayName>F12R1</displayName><description>Filter bank 4 register 1</description><addressOffset>0x2A0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>F12R2</name><displayName>F12R2</displayName><description>Filter bank 12 register 2</description><addressOffset>0x2A4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</n