MaJerle/stm32f429/00-STM32_SVD/STM32F303xE.svd
        interrupts</description><value>54</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMAUDRIE2</name><description>DAC channel2 DMA underrun interrupt               enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN2</name><description>DAC channel2 DMA enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>MAMP2</name><description>DAC channel2 mask/amplitude               selector</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>WAVE2</name><description>DAC channel2 noise/triangle wave               generation enable</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>TSEL2</name><description>DAC channel2 trigger               selection</description><bitOffset>19</bitOffset><bitWidth>3</bitWidth></field><field><name>TEN2</name><description>DAC channel2 trigger               enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFF2</name><description>DAC channel2 output buffer               disable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EN2</name><description>DAC channel2 enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAUDRIE1</name><description>DAC channel1 DMA Underrun Interrupt               enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN1</name><description>DAC channel1 DMA enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MAMP1</name><description>DAC channel1 mask/amplitude               selector</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>WAVE1</name><description>DAC channel1 noise/triangle wave               generation enable</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>TSEL1</name><description>DAC channel1 trigger               selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>TEN1</name><description>DAC channel1 trigger               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFF1</name><description>DAC channel1 output buffer               disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN1</name><description>DAC channel1 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SWTRIGR</name><displayName>SWTRIGR</displayName><description>software trigger register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>SWTRIG2</name><description>DAC channel2 software               trigger</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SWTRIG1</name><description>DAC channel1 software               trigger</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DHR12R1</name><displayName>DHR12R1</displayName><description>channel1 12-bit right-aligned data holding           register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12L1</name><displayName>DHR12L1</displayName><description>channel1 12-bit left aligned data holding           register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8R1</name><displayName>DHR8R1</displayName><description>channel1 8-bit right aligned data holding           register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DHR12R2</name><displayName>DHR12R2</displayName><description>channel2 12-bit right aligned data holding           register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12L2</name><displayName>DHR12L2</displayName><description>channel2 12-bit left aligned data holding           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8R2</name><displayName>DHR8R2</displayName><description>channel2 8-bit right-aligned data holding           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DHR12RD</name><displayName>DHR12RD</displayName><description>Dual DAC 12-bit right-aligned data holding           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit right-aligned               data</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12LD</name><displayName>DHR12LD</displayName><description>DUAL DAC 12-bit left aligned data holding           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit left-aligned               data</description><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8RD</name><displayName>DHR8RD</displayName><description>DUAL DAC 8-bit right aligned data holding           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 8-bit right-aligned               data</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DOR1</name><displayName>DOR1</displayName><description>channel1 data output register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DOR</name><description>DAC channel1 data output</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DOR2</name><displayName>DOR2</displayName><description>channel2 data output register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DOR</name><description>DAC channel2 data output</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMAUDR2</name><description>DAC channel2 DMA underrun               flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAUDR1</name><description>DAC channel1 DMA underrun               flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>NVIC</name><description>Nested Vectored Interrupt       Controller</description><groupName>NVIC</groupName><baseAddress>0xE000E000</baseAddress><addressBlock><offset>0x0</offset><size>0x1001</size><usage>registers</usage></addressBlock><registers><register><name>ICTR</name><displayName>ICTR</displayName><description>Interrupt Controller Type           Register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>INTLINESNUM</name><description>Total number of interrupt lines in               groups</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>STIR</name><displayName>STIR</displayName><description>Software Triggered Interrupt           Register</description><addressOffset>0xF00</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>INTID</name><description>interrupt to be triggered</description><bitOffset>0</bitOffset><bitWidth>9</bitWidth></field></fields></register><register><name>ISER0</name><displayName>ISER0</displayName><description>Interrupt Set-Enable Register</description><addressOffset>0x100</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SETENA</name><description>SETENA</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ISER1</name><displayName>ISER1</displayName><description>Interrupt Set-Enable Register</description><addressOffset>0x104</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SETENA</name><description>SETENA</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ISER2</name><displayName>ISER2</displayName><description>Interrupt Set-Enable Register</description><addressOffset>0x108</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SETENA</name><description>SETENA</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ICER0</name><displayName>ICER0</displayName><description>Interrupt Clear-Enable           Register</description><addressOffset>0x180</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CLRENA</name><description>CLRENA</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ICER1</name><displayName>ICER1</displayName><description>Interrupt Clear-Enable           Register</description><addressOffset>0x184</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CLRENA</name><description>CLRENA</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ICER2</name><displayName>ICER2</displayName><description>Interrupt Clear-Enable           Register</description><addressOffset>0x188</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CLRENA</name><description>CLRENA</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ISPR0</name><displayName>ISPR0</displayName><description>Interrupt Set-Pending Register</description><addressOffset>0x200</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SETPEND</name><description>SETPEND</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ISPR1</name><displayName>ISPR1</displayName><description>Interrupt Set-Pending Register</description><addressOffset>0x204</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SETPEND</name><description>SETPEND</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ISPR2</name><displayName>ISPR2</displayName><description>Interrupt Set-Pending Register</description><addressOffset>0x208</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SETPEND</name><description>SETPEND</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ICPR0</name><displayName>ICPR0</displayName><description>Interrupt Clear-Pending           Register</description><addressOffset>0x280</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CLRPEND</name><description>CLRPEND</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ICPR1</name><displayName>ICPR1</displayName><description>Interrupt Clear-Pending           Register</description><addressOffset>0x284</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CLRPEND</name><description>CLRPEND</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>ICPR2</name><displayName>ICPR2</displayName><description>Interrupt Clear-Pending           Register</description><addressOffset>0x288</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CLRPEND</name><description>CLRPEND</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>IABR0</name><displayName>IABR0</displayName><description>Interrupt Active Bit Register</description><addressOffset>0x300</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>ACTIVE</name><description>ACTIVE</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>IABR1</name><displayName>IABR1</displayName><description>Interrupt Active Bit Register</description><addressOffset>0x304</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>ACTIVE</name><description>ACTIVE</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>IABR2</name><displayName>IABR2</displayName><description>Interrupt Active Bit Register</description><addressOffset>0x308</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>ACTIVE</name><description>ACTIVE</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>IPR0</name><displayName>IPR0</displayName><description>Interrupt Priority Register</description><addressOffset>0x400</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR1</name><displayName>IPR1</displayName><description>Interrupt Priority Register</description><addressOffset>0x404</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR2</name><displayName>IPR2</displayName><description>Interrupt Priority Register</description><addressOffset>0x408</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR3</name><displayName>IPR3</displayName><description>Interrupt Priority Register</description><addressOffset>0x40C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR4</name><displayName>IPR4</displayName><description>Interrupt Priority Register</description><addressOffset>0x410</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR5</name><displayName>IPR5</displayName><description>Interrupt Priority Register</description><addressOffset>0x414</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR6</name><displayName>IPR6</displayName><description>Interrupt Priority Register</description><addressOffset>0x418</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR7</name><displayName>IPR7</displayName><description>Interrupt Priority Register</description><addressOffset>0x41C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR8</name><displayName>IPR8</displayName><description>Interrupt Priority Register</description><addressOffset>0x420</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR9</name><displayName>IPR9</displayName><description>Interrupt Priority Register</description><addressOffset>0x424</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR10</name><displayName>IPR10</displayName><description>Interrupt Priority Register</description><addressOffset>0x428</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IPR_N0</name><description>IPR_N0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N1</name><description>IPR_N1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N2</name><description>IPR_N2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>IPR_N3</name><description>IPR_N3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IPR11</name><displayName>IPR11</displayName><description>Interrupt Priority Register</description><addressOffset>0x42C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue