MaJerle/stm32f429/00-STM32_SVD/STM32F303xE.svd
ue><fields><field><name>CCR5</name><description>Capture/Compare 5 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>GC5C1</name><description>Group Channel 5 and Channel               1</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>GC5C2</name><description>Group Channel 5 and Channel               2</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>GC5C3</name><description>Group Channel 5 and Channel               3</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR6</name><displayName>CCR6</displayName><description>capture/compare register 6</description><addressOffset>0x5C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR6</name><description>Capture/Compare 6 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>OR</name><displayName>OR</displayName><description>option registers</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM1_ETR_ADC1_RMP</name><description>TIM1_ETR_ADC1 remapping               capability</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>TIM1_ETR_ADC4_RMP</name><description>TIM1_ETR_ADC4 remapping               capability</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="TIM1"><name>TIM20</name><baseAddress>0x40015000</baseAddress><interrupt><name>TIM1_CC</name><description>TIM1 capture compare interrupt</description><value>27</value></interrupt></peripheral><peripheral><name>TIM8</name><description>Advanced-timers</description><groupName>TIMs</groupName><baseAddress>0x40013400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM8_BRK</name><description>TIM8 break interrupt</description><value>43</value></interrupt><interrupt><name>TIM8_UP</name><description>TIM8 update interrupt</description><value>44</value></interrupt><interrupt><name>TIM8_TRG_COM</name><description>TIM8 Trigger and commutation
