MaJerle/stm32f429/00-STM32_SVD/STM32F303xE.svd
itOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>BDTR</name><displayName>BDTR</displayName><description>break and dead-time register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DTG</name><description>Dead-time generator setup</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>LOCK</name><description>Lock configuration</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>OSSI</name><description>Off-state selection for Idle               mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OSSR</name><description>Off-state selection for Run               mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BKE</name><description>Break enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BKP</name><description>Break polarity</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>AOE</name><description>Automatic output enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>MOE</name><description>Main output enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>BKF</name><description>Break filter</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>BK2F</name><description>Break 2 filter</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>BK2E</name><description>Break 2 enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>BK2P</name><description>Break 2 polarity</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DCR</name><displayName>DCR</displayName><description>DMA control register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DBL</name><description>DMA burst length</description><bitOffset>8</bitOffset><bitWidth>5</bitWidth></field><field><name>DBA</name><description>DMA base address</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>DMAR</name><displayName>DMAR</displayName><description>DMA address for full transfer</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMAB</name><description>DMA register for burst               accesses</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCMR3_Output</name><displayName>CCMR3_Output</displayName><description>capture/compare mode register 3 (output           mode)</description><addressOffset>0x54</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OC5FE</name><description>Output compare 5 fast               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OC5PE</name><description>Output compare 5 preload               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC5M</name><description>Output compare 5 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC5CE</name><description>Output compare 5 clear               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OC6FE</name><description>Output compare 6 fast               enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OC6PE</name><description>Output compare 6 preload               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OC6M</name><description>Output compare 6 mode</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>OC6CE</name><description>Output compare 6 clear               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>OC5M_3</name><description>Outout Compare 5 mode bit               3</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>OC6M_3</name><description>Outout Compare 6 mode bit               3</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR5</name><displayName>CCR5</displayName><description>capture/compare register 5</description><addressOffset>0x58</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR5</name><description>Capture/Compare 5 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>GC5C1</name><description>Group Channel 5 and Channel               1</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>GC5C2</name><description>Group Channel 5 and Channel               2</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>GC5C3</name><description>Group Channel 5 and Channel               3</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR6</name><displayName>CCR6</displayName><description>capture/compare register 6</description><addressOffset>0x5C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR6</name><description>Capture/Compare 6 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>OR</name><displayName>OR</displayName><description>option registers</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM8_ETR_ADC2_RMP</name><description>TIM8_ETR_ADC2 remapping               capability</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>TIM8_ETR_ADC3_RMP</name><description>TIM8_ETR_ADC3 remapping               capability</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral><name>ADC1</name><description>Analog-to-Digital Converter</description><groupName>ADC</groupName><baseAddress>0x50000000</baseAddress><addressBlock><offset>0x0</offset><size>0x100</size><usage>registers</usage></addressBlock><interrupt><name>ADC1_2</name><description>ADC1 and ADC2 global interrupt</description><value>18</value></interrupt><registers><register><name>ISR</name><displayName>ISR</displayName><description>interrupt and status register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>JQOVF</name><description>JQOVF</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD3</name><description>AWD3</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD2</name><description>AWD2</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD1</name><description>AWD1</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOS</name><description>JEOS</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOC</name><description>JEOC</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>OVR</name><description>OVR</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>EOS</name><description>EOS</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>EOC</name><description>EOC</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EOSMP</name><description>EOSMP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ADRDY</name><description>ADRDY</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IER</name><displayName>IER</displayName><description>interrupt enable register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>JQOVFIE</name><description>JQOVFIE</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD3IE</name><description>AWD3IE</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD2IE</name><description>AWD2IE</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD1IE</name><description>AWD1IE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOSIE</name><description>JEOSIE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOCIE</name><description>JEOCIE</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>OVRIE</name><description>OVRIE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>EOSIE</name><description>EOSIE</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>EOCIE</name><description>EOCIE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EOSMPIE</name><description>EOSMPIE</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ADRDYIE</name><description>ADRDYIE</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ADCAL</name><description>ADCAL</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>ADCALDIF</name><description>ADCALDIF</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>DEEPPWD</name><description>DEEPPWD</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>ADVREGEN</name><description>ADVREGEN</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>JADSTP</name><description>JADSTP</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ADSTP</name><description>ADSTP</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>JADSTART</name><description>JADSTART</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ADSTART</name><description>ADSTART</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ADDIS</name><description>ADDIS</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ADEN</name><description>ADEN</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CFGR</name><displayName>CFGR</displayName><description>configuration register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AWDCH1CH</name><description>AWDCH1CH</description><bitOffset>26</bitOffset><bitWidth>5</bitWidth></field><field><name>JAUTO</name><description>JAUTO</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>JAWD1EN</name><description>JAWD1EN</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD1EN</name><description>AWD1EN</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD1SGL</name><description>AWD1SGL</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>JQM</name><description>JQM</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>JDISCEN</name><description>JDISCEN</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>DISCNUM</name><description>DISCNUM</description><bitOffset>17</bitOffset><bitWidth>3</bitWidth></field><field><name>DISCEN</name><description>DISCEN</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTOFF</name><description>AUTOFF</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTDLY</name><description>AUTDLY</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CONT</name><description>CONT</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>OVRMOD</name><description>OVRMOD</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTEN</name><description>EXTEN</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTSEL</name><description>EXTSEL</description><bitOffset>6</bitOffset><bitWidth>4</bitWidth></field><field><name>ALIGN</name><description>ALIGN</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>RES</name><description>RES</description><bitOffset>3</bitOffset><bitWidth>2</bitWidth></field><field><name>DMACFG</name><description>DMACFG</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN</name><description>DMAEN</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SMPR1</name><displayName>SMPR1</displayName><description>sample time register 1</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SMP9</name><description>SMP9</description><bitOffset>27</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP8</name><description>SMP8</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP7</name><description>SMP7</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP6</name><description>SMP6</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP5</name><description>SMP5</description><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP4</name><description>SMP4</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP3</name><description>SMP3</description><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP2</name><description>SMP2</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP1</name><description>SMP1</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>SMPR2</name><displayName>SMPR2</displayName><description>sample time register 2</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SMP18</name><description>SMP18</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP17</name><description>SMP17</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP16</name><description>SMP16</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP15</name><description>SMP15</description><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP14</name><description>SMP14</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP13</name><description>SMP13</description><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP12</name><description>SMP12</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP11</name><description>SMP11</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP10</name><description>SMP10</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>TR1</name><displayName>TR1</displayName><description>watchdog threshold register 1</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0FFF0000</resetValue><fields><field><name>HT1</name><description>HT1</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field><field><name>LT1</name><description>LT1</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>TR2</name><displayName>TR2</displayName><description>watchdog threshold register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0FFF0000</resetValue><fields><field><name>HT2</name><description>HT2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>LT2</name><description>LT2</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TR3</name><displayName>TR3</displayName><description>watchdog threshold register 3</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0FFF0000</resetValue><fields><field><name>HT3</name><description>HT3</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>LT3</name><description>LT3</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>SQR1</name><displayName>SQR1</displayName><description>regular sequence register 1</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SQ4</name><description>SQ4</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ3</name><description>SQ3</description><bitOffset>18</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ2</name><description>SQ2</description><bitOffset>12</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ1</name><description>SQ1</description><bitOffset>6</bitOffset><bitWidth>5</bitWidth></field><field><name>L3</name><description>L3</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>SQR2</name><displayName>SQR2</displayName><description>regular sequence register 2</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SQ9</name><description>SQ9</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ8</name><description>SQ8</description><bitOffset>18</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ7</name><description>SQ7</description><bitOffset>12</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ6</name><description>SQ6</description><bitOffset>6</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ5</name><description>SQ5</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>SQR3</name><displayName>SQR3</displayName><description>regular sequence register 3</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SQ14</name><description>SQ14</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ13</name><description>SQ13</description><bitOffset>18</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ12</name><description>SQ12</description><bitOffset>12</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ11</name><description>SQ11</description><bitOffset>6</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ10</name><description>SQ10</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>SQR4</name><displayName>SQR4</displayName><description>regular sequence register 4</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SQ16</name><description>SQ16</description><bitOffset>6</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ15</name><description>SQ15</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>DR</name><displayName>DR</displayName><description>regular Data Register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>regularDATA</name><description>regularDATA</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>JSQR</name><displayName>JSQR</displayName><description>injected sequence register</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>JSQ4</name><description>JSQ4</description><bitOffset>26</bitOffset><bitWidth>5</bitWidth></field><field><name>JSQ3</name><description>JSQ3</description><bitOffset>20</bitOffset><bitWidth>5</bitWidth></field><field><name>JSQ2</name><description>JSQ2</description><bitOffset>14</bitOffset><bitWidth>5</bitWidth></field><field><name>JSQ1</name><description>JSQ1</description><bitOffset>8</bitOffset><bitWidth>5</bitWidth></field><field><name>JEXTEN</name><description>JEXTEN</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>JEXTSEL</name><description>JEXTSEL</description><bitOffset>2</bitOffset><bitWidth>4</bitWidth></field><field><name>JL</name><description>JL</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>OFR1</name><displayName>OFR1</displayName><description>offset register 1</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OFFSET1_EN</name><description>OFFSET1_EN</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>OFFSET1_CH</name><description>OFFSET1_CH</description><bitOffset>26</bitOffset><bitWidth>5</bitWidth></field><field><name>OFFSET1</name><description>OFFSET1</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>OFR2</name><displayName>OFR2</displayName><description>offset register 2</description><addressOffset>0x64</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OFFSET2_EN</name><description>OFFSET2_EN</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>OFFSET2_CH</name><description>OFFSET2_CH</description><bitOffset>26</bitOffset><bitWidth>5</bitWidth></field><field><name>OFFSET2</name><description>OFFSET2</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>OFR3</name><displayName>OFR3</displayName><description>offset register 3</description><addressOffset>0x68</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OFFSET3_EN</name><description>OFFSET3_EN</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>OFFSET3_CH</name><description>OFFSET3_CH</description><bitOffset>26</bitOffset><bitWidth>5</bitWidth></field><field><name>OFFSET3</name><description>OFFSET3</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>OFR4</name><displayName>OFR4</displayName><description>offset register 4</description><addressOffset>0x6C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OFFSET4_EN</name><description>OFFSET4_EN</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>OFFSET4_CH</name><description>OFFSET4_CH</description><bitOffset>26</bitOffset><bitWidth>5</bitWidth></field><field><name>OFFSET4</name><description>OFFSET4</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>JDR1</name><displayName>JDR1</disp