MaJerle/stm32f429/00-STM32_SVD/STM32F303xE.svd
layName><description>injected data register 1</description><addressOffset>0x80</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>JDATA1</name><description>JDATA1</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>JDR2</name><displayName>JDR2</displayName><description>injected data register 2</description><addressOffset>0x84</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>JDATA2</name><description>JDATA2</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>JDR3</name><displayName>JDR3</displayName><description>injected data register 3</description><addressOffset>0x88</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>JDATA3</name><description>JDATA3</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>JDR4</name><displayName>JDR4</displayName><description>injected data register 4</description><addressOffset>0x8C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>JDATA4</name><description>JDATA4</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>AWD2CR</name><displayName>AWD2CR</displayName><description>Analog Watchdog 2 Configuration           Register</description><addressOffset>0xA0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AWD2CH</name><description>AWD2CH</description><bitOffset>1</bitOffset><bitWidth>18</bitWidth></field></fields></register><register><name>AWD3CR</name><displayName>AWD3CR</displayName><description>Analog Watchdog 3 Configuration           Register</description><addressOffset>0xA4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AWD3CH</name><description>AWD3CH</description><bitOffset>1</bitOffset><bitWidth>18</bitWidth></field></fields></register><register><name>DIFSEL</name><displayName>DIFSEL</displayName><description>Differential Mode Selection Register           2</description><addressOffset>0xB0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>DIFSEL_1_15</name><description>Differential mode for channels 15 to               1</description><bitOffset>1</bitOffset><bitWidth>15</bitWidth><access>read-write</access></field><field><name>DIFSEL_16_18</name><description>Differential mode for channels 18 to               16</description><bitOffset>16</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field></fields></register><register><name>CALFACT</name><displayName>CALFACT</displayName><description>Calibration Factors</description><addressOffset>0xB4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CALFACT_D</name><description>CALFACT_D</description><bitOffset>16</bitOffset><bitWidth>7</bitWidth></field><field><name>CALFACT_S</name><description>CALFACT_S</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="ADC1"><name>ADC2</name><baseAddress>0x50000100</baseAddress><interrupt><name>ADC1_2</name><description>ADC1 and ADC2 global interrupt</description><value>18</value></interrupt></peripheral><peripheral derivedFrom="ADC1"><name>ADC3</name><baseAddress>0x50000400</baseAddress><interrupt><name>ADC3</name><description>ADC3 global interrupt</description><value>47</value></interrupt></peripheral><peripheral derivedFrom="ADC1"><name>ADC4</name><baseAddress>0x50000500</baseAddress><interrupt><name>ADC4</name><description>ADC4 global interrupt</description><value>61</value></interrupt></peripheral><peripheral><name>ADC1_2</name><description>Analog-to-Digital Converter</description><groupName>ADC</groupName><baseAddress>0x50000300</baseAddress><addressBlock><offset>0x0</offset><size>0xD</size><usage>registers</usage></addressBlock><registers><register><name>CSR</name><displayName>CSR</displayName><description>ADC Common status register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>ADDRDY_MST</name><description>ADDRDY_MST</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EOSMP_MST</name><description>EOSMP_MST</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EOC_MST</name><description>EOC_MST</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EOS_MST</name><description>EOS_MST</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OVR_MST</name><description>OVR_MST</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOC_MST</name><description>JEOC_MST</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOS_MST</name><description>JEOS_MST</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD1_MST</name><description>AWD1_MST</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD2_MST</name><description>AWD2_MST</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD3_MST</name><description>AWD3_MST</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>JQOVF_MST</name><description>JQOVF_MST</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ADRDY_SLV</name><description>ADRDY_SLV</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>EOSMP_SLV</name><description>EOSMP_SLV</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EOC_SLV</name><description>End of regular conversion of the slave               ADC</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>EOS_SLV</name><description>End of regular sequence flag of the               slave ADC</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>OVR_SLV</name><description>Overrun flag of the slave               ADC</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOC_SLV</name><description>End of injected conversion flag of the               slave ADC</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOS_SLV</name><description>End of injected sequence flag of the               slave ADC</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD1_SLV</name><description>Analog watchdog 1 flag of the slave               ADC</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD2_SLV</name><description>Analog watchdog 2 flag of the slave               ADC</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD3_SLV</name><description>Analog watchdog 3 flag of the slave               ADC</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>JQOVF_SLV</name><description>Injected Context Queue Overflow flag of               the slave ADC</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR</name><displayName>CCR</displayName><description>ADC common control register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MULT</name><description>Multi ADC mode selection</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>DELAY</name><description>Delay between 2 sampling               phases</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>DMACFG</name><description>DMA configuration (for multi-ADC               mode)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>MDMA</name><description>Direct memory access mode for multi ADC               mode</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field><field><name>CKMODE</name><description>ADC clock mode</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>VREFEN</name><description>VREFINT enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TSEN</name><description>Temperature sensor enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>VBATEN</name><description>VBAT enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CDR</name><displayName>CDR</displayName><description>ADC common regular data register for dual           and triple modes</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>RDATA_SLV</name><description>Regular data of the slave               ADC</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>RDATA_MST</name><description>Regular data of the master               ADC</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="ADC1_2"><name>ADC3_4</name><baseAddress>0x50000700</baseAddress></peripheral><peripheral><name>SYSCFG</name><description>System configuration controller</description><groupName>SYSCFG</groupName><baseAddress>0x40010000</baseAddress><addressBlock><offset>0x0</offset><size>0x19</size><usage>registers</usage></addressBlock><registers><register><name>CFGR1</name><displayName>CFGR1</displayName><description>configuration register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM_MODE</name><description>Memory mapping selection               bits</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>USB_IT_RMP</name><description>USB interrupt remap</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1_ITR_RMP</name><description>Timer 1 ITR3 selection</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>DAC_TRIG_RMP</name><description>DAC trigger remap (when TSEL =               001)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC24_DMA_RMP</name><description>ADC24 DMA remapping bit</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM16_DMA_RMP</name><description>TIM16 DMA request remapping               bit</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM17_DMA_RMP</name><description>TIM17 DMA request remapping               bit</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM6_DAC1_DMA_RMP</name><description>TIM6 and DAC1 DMA request remapping               bit</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM7_DAC2_DMA_RMP</name><description>TIM7 and DAC2 DMA request remapping               bit</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C_PB6_FM</name><description>Fast Mode Plus (FM+) driving capability               activation bits.</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C_PB7_FM</name><description>Fast Mode Plus (FM+) driving capability               activation bits.</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C_PB8_FM</name><description>Fast Mode Plus (FM+) driving capability               activation bits.</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C_PB9_FM</name><description>Fast Mode Plus (FM+) driving capability               activation bits.</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1_FM</name><description>I2C1 Fast Mode Plus</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2_FM</name><description>I2C2 Fast Mode Plus</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>ENCODER_MODE</name><description>Encoder mode</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>FPU_IT</name><description>Interrupt enable bits from               FPU</description><bitOffset>26</bitOffset><bitWidth>6</bitWidth></field></fields></register><register><name>EXTICR1</name><displayName>EXTICR1</displayName><description>external interrupt configuration register           1</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI3</name><description>EXTI 3 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI2</name><description>EXTI 2 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI1</name><description>EXTI 1 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI0</name><description>EXTI 0 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR2</name><displayName>EXTICR2</displayName><description>external interrupt configuration register           2</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI7</name><description>EXTI 7 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI6</name><description>EXTI 6 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI5</name><description>EXTI 5 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI4</name><description>EXTI 4 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR3</name><displayName>EXTICR3</displayName><description>external interrupt configuration register           3</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI11</name><description>EXTI 11 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI10</name><description>EXTI 10 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI9</name><description>EXTI 9 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI8</name><description>EXTI 8 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR4</name><displayName>EXTICR4</displayName><description>external interrupt configuration register           4</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI15</name><description>EXTI 15 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI14</name><description>EXTI 14 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI13</name><description>EXTI 13 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI12</name><description>EXTI 12 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CFGR2</name><displayName>CFGR2</displayName><description>configuration register 2</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>LOCUP_LOCK</name><description>Cortex-M0 LOCKUP bit enable               bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAM_PARITY_LOCK</name><description>SRAM parity lock bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PVD_LOCK</name><description>PVD lock enable bit</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BYP_ADD_PAR</name><description>Bypass address bit 29 in parity               calculation</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAM_PEF</name><description>SRAM parity flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RCR</name><displayName>RCR</displayName><description>CCM SRAM protection register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>PAGE0_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE1_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE2_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE3_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE4_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE5_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE6_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE7_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>OPAMP</name><description>Operational amplifier</description><groupName>OPAMP</groupName><baseAddress>0x40010038</baseAddress><addressBlock><offset>0x0</offset><size>0x3C8</size><usage>registers</usage></addressBlock><registers><register><name>OPAMP1_CR</name><displayName>OPAMP1_CR</displayName><description>OPAMP1 control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>OPAMP1_EN</name><description>OPAMP1 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FORCE_VP</name><description>FORCE_VP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VP_SEL</name><description>OPAMP1 Non inverting input               selection</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>VM_SEL</name><description>OPAMP1 inverting input               selection</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TCM_EN</name><description>Timer controlled Mux mode               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VMS_SEL</name><description>OPAMP1 inverting input secondary               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VPS_SEL</name><description>OPAMP1 Non inverting input secondary               selection</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CALON</name><description>Calibration mode enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CALSEL</name><description>Calibration selection</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PGA_GAIN</name><description>Gain in PGA mode</description><bitOffset>14</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>USER_TRIM</name><description>User trimming enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETP</name><description>Offset trimming value               (PMOS)</description><bitOffset>19</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETN</name><description>Offset trimming value               (NMOS)</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TSTREF</name><description>TSTREF</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTCAL</name><description>OPAMP 1 ouput status flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOCK</name><description>OPAMP 1 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OPAMP2_CR</name><displayName>OPAMP2_CR</displayName><description>OPAMP2 control register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>OPAMP2EN</name><description>OPAMP2 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FORCE_VP</name><description>FORCE_VP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VP_SEL</name><description>OPAMP2 Non inverting input               selection</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>VM_SEL</name><description>OPAMP2 inverting input               selection</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TCM_EN</name><description>Timer controlled Mux mode               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VMS_SEL</name><description>OPAMP2 inverting input secondary               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VPS_SEL</name><description>OPAMP2 Non inverting input secondary               selection</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CALON</name><description>Calibration mode enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAL_SEL</name><description>Calibration selection</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PGA_GAIN</name><description>Gain in PGA mode</description><bitOffset>14</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>USER_TRIM</name><description>User trimming enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETP</name><description>Offset trimming value               (PMOS)</description><bitOffset>19</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETN</name><description>Offset trimming value               (NMOS)</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth><access>read-write</access></